; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=79, remove_proportion=0.101, bases=31, instance_id=24, output=./training, seed=65

(define (problem warehouse-24)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 box47 box48 box49 box50 box51 box52 box53 box54 box55 box56 box57 box58 box59 box60 box61 box62 box63 box64 box65 box66 box67 box68 box69 box70 box71 box72 box73 box74 box75 box76 box77 box78 box79 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 base15 base16 base17 base18 base19 base20 base21 base22 base23 base24 base25 base26 base27 base28 base29 base30 base31 - base
    )
    (:init
        (to-remove box29)
        (to-remove box37)
        (to-remove box54)
        (to-remove box57)
        (to-remove box59)
        (to-remove box66)
        (to-remove box78)
        (clear box53)
        (on box53 box72)
        (on box72 box63)
        (on-base box63 base1)
        (clear box49)
        (on box49 box21)
        (on-base box21 base2)
        (clear box11)
        (on box11 box67)
        (on-base box67 base3)
        (clear box23)
        (on box23 box32)
        (on-base box32 base4)
        (clear box33)
        (on box33 box51)
        (on box51 box28)
        (on-base box28 base5)
        (clear box24)
        (on box24 box64)
        (on box64 box76)
        (on box76 box73)
        (on-base box73 base6)
        (clear box16)
        (on-base box16 base7)
        (clear box45)
        (on box45 box41)
        (on box41 box10)
        (on-base box10 base8)
        (clear box57)
        (on box57 box62)
        (on box62 box22)
        (on box22 box15)
        (on box15 box68)
        (on-base box68 base9)
        (clear-base base10)
        (clear box5)
        (on box5 box59)
        (on box59 box56)
        (on-base box56 base11)
        (clear box39)
        (on box39 box35)
        (on box35 box36)
        (on-base box36 base12)
        (clear box46)
        (on-base box46 base13)
        (clear box66)
        (on box66 box8)
        (on-base box8 base14)
        (clear box14)
        (on box14 box47)
        (on box47 box2)
        (on-base box2 base15)
        (clear box18)
        (on box18 box48)
        (on-base box48 base16)
        (clear box1)
        (on box1 box25)
        (on-base box25 base17)
        (clear box3)
        (on box3 box13)
        (on box13 box71)
        (on box71 box79)
        (on-base box79 base18)
        (clear box77)
        (on box77 box37)
        (on-base box37 base19)
        (clear box19)
        (on box19 box40)
        (on-base box40 base20)
        (clear box38)
        (on box38 box44)
        (on box44 box7)
        (on box7 box17)
        (on-base box17 base21)
        (clear box30)
        (on-base box30 base22)
        (clear box20)
        (on box20 box50)
        (on box50 box34)
        (on-base box34 base23)
        (clear box26)
        (on box26 box65)
        (on-base box65 base24)
        (clear box52)
        (on box52 box60)
        (on box60 box54)
        (on-base box54 base25)
        (clear box78)
        (on box78 box75)
        (on box75 box29)
        (on-base box29 base26)
        (clear box31)
        (on box31 box6)
        (on box6 box74)
        (on-base box74 base27)
        (clear box43)
        (on box43 box55)
        (on box55 box27)
        (on-base box27 base28)
        (clear box12)
        (on box12 box9)
        (on box9 box70)
        (on box70 box61)
        (on-base box61 base29)
        (clear box42)
        (on box42 box4)
        (on-base box4 base30)
        (clear box58)
        (on box58 box69)
        (on-base box69 base31)
    )
    (:goal (and 
        (removed box29)
        (removed box37)
        (removed box54)
        (removed box57)
        (removed box59)
        (removed box66)
        (removed box78)
    ))
)

; plan
1. (move box5 box59 box1)
   deleted: (clear box1) (on box5 box59)
   added: (on box5 box1) (clear box59)
   goals met: 0 of 7
2. (move box52 box60 box11)
   deleted: (clear box11) (on box52 box60)
   added: (on box52 box11) (clear box60)
   goals met: 0 of 7
3. (move box60 box54 box12)
   deleted: (clear box12) (on box60 box54)
   added: (on box60 box12) (clear box54)
   goals met: 0 of 7
4. (move box77 box37 box14)
   deleted: (clear box14) (on box77 box37)
   added: (on box77 box14) (clear box37)
   goals met: 0 of 7
5. (remove-from-base box37 base19)
   deleted: (on-base box37 base19) (clear box37)
   added: (removed box37) (clear-base base19)
   goals met: 1 of 7
6. (remove-from-base box54 base25)
   deleted: (on-base box54 base25) (clear box54)
   added: (removed box54) (clear-base base25)
   goals met: 2 of 7
7. (remove box57 box62)
   deleted: (on box57 box62) (clear box57)
   added: (removed box57) (clear box62)
   goals met: 3 of 7
8. (remove box59 box56)
   deleted: (on box59 box56) (clear box59)
   added: (removed box59) (clear box56)
   goals met: 4 of 7
9. (remove box66 box8)
   deleted: (on box66 box8) (clear box66)
   added: (removed box66) (clear box8)
   goals met: 5 of 7
10. (remove box78 box75)
   deleted: (on box78 box75) (clear box78)
   added: (removed box78) (clear box75)
   goals met: 6 of 7
11. (move box75 box29 box16)
   deleted: (clear box16) (on box75 box29)
   added: (on box75 box16) (clear box29)
   goals met: 6 of 7
12. (remove-from-base box29 base26)
   deleted: (on-base box29 base26) (clear box29)
   added: (removed box29) (clear-base base26)
   goals met: 7 of 7
